import pandas is the first step and assign it to the 'pd' variable.

In [ ]:
import pandas as pd

create a column and see the difference.

In [ ]:
column = ["Mariya","Batman","Spongebob"]
#just print it to get the basic structure.
print(column)
print("----------------------------------------------------------")
#now assign it to the pandas.
data = pd.DataFrame(column)
print(data)

['Mariya', 'Batman', 'Spongebob']
----------------------------------------------------------
           0
0     Mariya
1     Batman
2  Spongebob

So now we try to put the colum names

In [ ]:
title_column = {
    "name":["Mariya","Batman","Spongebob"]
}
data = pd.DataFrame(title_column)
print(data)

        name
0     Mariya
1     Batman
2  Spongebob

Adding new columns

In [ ]:
title_column = {
    "name":["Mariya","Batman","Spongebob"],
    "age":[20,30,40],
    "height":[1.67,1.9,0.25],
    "weight":[50,50,50]
}
data = pd.DataFrame(title_column)
print(data)
#

        name  age  height  weight
0     Mariya   20    1.67      50
1     Batman   30    1.90      50
2  Spongebob   40    0.25      50

only get values in one column

In [ ]:
select_column = data["height"]
print(select_column)

0    1.67
1    1.90
2    0.25
Name: height, dtype: float64

if only need the batman height.

In [ ]:
select_column = data["height"][1]
print(select_column)

1.9

select a row

In [ ]:
select_row = data.iloc[1] #in the case of batman
print(select_row)

name      Batman
age           30
height       1.9
weight        50
Name: 1, dtype: object

if we need only the weight.

In [ ]:
select_row = data.iloc[1]["weight"] #in the case of batman
print(select_row)

50

manipulate dataframe values.

In [ ]:
bmi = [] # weight/(height ** 2)
for i in range(len(data)):
    bmi.append(data["weight"][i]/(data.iloc[i]["height"]**2))
data["bmi"] = bmi
print(data)

        name  age  height  weight         bmi
0     Mariya   20    1.67      50   17.928215
1     Batman   30    1.90      50   13.850416
2  Spongebob   40    0.25      50  800.000000

save the dataframe to a file

In [ ]:
data.to_csv("bmi.csv",sep="\t") #sep is use to separate the data.
data.to_csv("bmi.txt",sep="\t") #sep is use to separate the data.

load them from a csv file.

In [ ]:
data = pd.read_csv("bmi.csv", sep="\t")
print(data)

   Unnamed: 0       name  age  height  weight         bmi
0           0     Mariya   20    1.67      50   17.928215
1           1     Batman   30    1.90      50   13.850416
2           2  Spongebob   40    0.25      50  800.000000

remove the first column

In [ ]:
data = pd.read_csv("bmi.csv",index_col = False, sep="\t")
print(data)

   Unnamed: 0       name  age  height  weight         bmi
0           0     Mariya   20    1.67      50   17.928215
1           1     Batman   30    1.90      50   13.850416
2           2  Spongebob   40    0.25      50  800.000000

This can be connect to sql database as well but i am not going to code that here.

next

how to print only the first 2 rows.

In [ ]:
print(data.head())# to get all values
print("----------------------------------------------------------------")
print(data.head(2))#to get two rows each.

   Unnamed: 0       name  age  height  weight         bmi
0           0     Mariya   20    1.67      50   17.928215
1           1     Batman   30    1.90      50   13.850416
2           2  Spongebob   40    0.25      50  800.000000
----------------------------------------------------------------
   Unnamed: 0    name  age  height  weight        bmi
0           0  Mariya   20    1.67      50  17.928215
1           1  Batman   30    1.90      50  13.850416

if we want last 2 we have to change the code into

In [ ]:
print(data.tail())# to get all values
print("----------------------------------------------------------------")
print(data.tail(2))#to get two rows each.

   Unnamed: 0       name  age  height  weight         bmi
0           0     Mariya   20    1.67      50   17.928215
1           1     Batman   30    1.90      50   13.850416
2           2  Spongebob   40    0.25      50  800.000000
----------------------------------------------------------------
   Unnamed: 0       name  age  height  weight         bmi
1           1     Batman   30    1.90      50   13.850416
2           2  Spongebob   40    0.25      50  800.000000

filter the data

In [ ]:
filter = data[data["age"] == 20]
print(filter)

   Unnamed: 0    name  age  height  weight        bmi
0           0  Mariya   20    1.67      50  17.928215

replace data entries

In [ ]:
replaced_data = data.replace("Mariya","Mariya2")
print(replaced_data)

   Unnamed: 0       name  age  height  weight         bmi
0           0    Mariya2   20    1.67      50   17.928215
1           1     Batman   30    1.90      50   13.850416
2           2  Spongebob   40    0.25      50  800.000000

remove data.

In [ ]:
remove_column = data.drop("bmi",axis = 1)
print(remove_column)
print("---------------------------------------------------------------")
remove_column = data.drop(["height","weight"],axis = 1)
print(remove_column)
print("---------------------------------------------------------------")
remove_row = data.iloc[0:2]
print(remove_row)
print("---------------------------------------------------------------")
print(data)

   Unnamed: 0       name  age  height  weight
0           0     Mariya   20    1.67      50
1           1     Batman   30    1.90      50
2           2  Spongebob   40    0.25      50
---------------------------------------------------------------
   Unnamed: 0       name  age         bmi
0           0     Mariya   20   17.928215
1           1     Batman   30   13.850416
2           2  Spongebob   40  800.000000
---------------------------------------------------------------
   Unnamed: 0    name  age  height  weight        bmi
0           0  Mariya   20    1.67      50  17.928215
1           1  Batman   30    1.90      50  13.850416
---------------------------------------------------------------
   Unnamed: 0       name  age  height  weight         bmi
0           0     Mariya   20    1.67      50   17.928215
1           1     Batman   30    1.90      50   13.850416
2           2  Spongebob   40    0.25      50  800.000000

add new rows

In [ ]:
row = {
    "name": "aag",
    "age":20,
    "height":1.23,
    "weight":100,
    "bmi":1.2356
}
new_row_df = pd.DataFrame([row])
new = pd.concat([data, new_row_df], ignore_index=True)
print(new)

   Unnamed: 0       name  age  height  weight         bmi
0         0.0     Mariya   20    1.67      50   17.928215
1         1.0     Batman   30    1.90      50   13.850416
2         2.0  Spongebob   40    0.25      50  800.000000
3         NaN        aag   20    1.23     100    1.235600

remove duplicates

In [ ]:
new = new.drop_duplicates(subset = ["name"])
print("now the row count is ",len(new))

now the row count is  4